#this text is copied from the book page 370
'''
python -m pdb looping.py
سيؤدي استخدام خيار سطر األوامر m- إلى استيراد أي وحدة بايثون تريدها، وفي حالتنا
فسنستورد الوحدة pdb، والتي سنمررها إلى الخيار m- كما هو م ِّبين في األمر السابق ستحصل
على الناتج اآلتي بعد تنفيذك لألمر السابق:
> /Users/sammy/looping.py(1)<module>()
-> num_list = [500, 600, 700]
(Pdb) | <<== this is the pointer


الحظ أن سطر أوامر pdb يختلف عن الوضع التفاعلي في بايثون، والحظ أ َّن منقح بايثون
سيبدأ ً من جديد حين وصوله إلى نهاية البرنامج تلقائيا؛ لذا يمكنك استخدام األمر quit أو exit
في أي وقتٍ تريد للخروج من المنقح .أما إذا أردت إعادة تشغيل المنقح من بداية البرنامج
ً مجددا، فيمكنك استعمال األمر run.


يمكننا كتابة األمر list ضمن منقح بايثون
التفاعلي للحصول على الشيفرات المحيطة بالسطر الحالي، فلو نفذناه عند السطر األول من
برنامج workshop.py فستبدو المخرجات كما يلي:
(Pdb) list
 1 -> num_list = [500, 600, 700]
 2 alpha_list = ['x', 'y', 'z']
 3 
 4 
 5 def nested_loop():
 6 for number in num_list:
 7 print(number)
 8 for letter in alpha_list:
 9 print(letter)
10 
11 if __name__ == '__main__':
(Pdb)
يشار إلى السطر الحالي بالمحرفين <- اللذين يشيران في حالتنا إلى أول سطر من البرنامج.
َّولما كان برنامجنا قص يرًا، فسنحصل على كامل البرنامج عند استخدام األمر list. فحين
ً  محيط استخدام الأمر list ا بالسطر الحالي، لكن
 دون أَّية وسائط، فسيعرض أحد عشر سطراً 
يمكننا تحديد ما هي األسطر التي نريد عرضها كما يلي
(Pdb) list 3, 7
 3 
 4 
 5 def nested_loop():
 6 for number in num_list:
 7 print(number)
(Pdb)

 للتنقل عبر البرنامج سطرًا بسطر، فيمكننا استخدام األمر step أو n

الف رق بين step و next ه و أ َّن step س تتوقف داخ ل دال ة ج رى اس تدعاؤها، أم ا next
ِّذ ال دوال وتتوق ف في الس طر الت الي من تنفي ذ الدال ة س نرى ه ذا الف رق رأي العين حين
فس تنف .
 س يمر على الحلق ات خط وةً نتعام ل م ع الدال ة الموج ودة في برنامجن .ا األم ر step خط وة ح تى
يص ل إلى نهاي ة الدال ة، مم  ا ي ِظه ر م ا ال ذي تفعل ه الحلق ة تمامً ا، إذ س نبدأ بطباع ة ال رقم
(number(print ثم ننطلق إلى طباعة األحرف (letter(print ثم نعود إلى الرقم وهكذا 


 قد ترغب في تفح  ص القيم الم َسندة إلى المتغيرات أثناء مرورك على الشيفرة، ويمكنك فع ل
ذلك باستخدام األمر pp  ، والذي يطبع قيمة التعبير الم َّمرر إليه باستخدام الوحدة p


تمل ك أغلبي ة األوام ر في المنقح pdb الش كل المختص ر من األم ر 
ه و s، والمختص ر من next ه و n. س يعرض ل ك األم ر help قائم ة االختص ارات المتاح .ة يمكن ك
ِّذ في المنقح بالضغط على زر اإلدخال 
أ Enter

من المرجح أنَّك ستعمل على برمجيات أكبر بكثير من المثال السابق، لذا قد ترغب بتفحص
دوال أو أسطر معينة بدلاً من المرور على كامل البرنامج، ويمكنك أن تضبط نقاط التوقف 
(breakpoints في البرنامج)باستخدام الأمر break(في محاث CMD)، فسيعمل البرنامج حتى نقطة التوقف المحددة عندما
تضيف نقطة توقف فسيسند المنقح رقماً إليها، وهذه الأرقام متتالية وتبدأ من 1 والتي يمكنك
. الاستفادة منها حين التعامل مع نقاط التوقف يمكن إضافة نقاط توقف في أسطر برمجية معينة
باستخدام الصيغة الآتية في منقح pdb على الشكل >number_line<:>file_program>:
(Pdb) break looping.py:5
Breakpoint 1 at /Users/sammy/looping.py:5
(Pdb)
اكتب clear ثم y لإزالة جميع نقاط التوقف الحالية، يمكنك بعدها أن تضع نقطة توقف



'''
